---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wood.TextureRealWorldOffsetX
source: html/6d28f2e0-1182-a02c-58b1-9638523a7995.htm
---
# Autodesk.Revit.DB.Visual.Wood.TextureRealWorldOffsetX Property

The property labeled "Offset X" from the "Wood" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetX { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".